tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap 'homebrew/cask-versions'
tap "homebrew/bundle"
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'bash' # Latest Bash version
brew 'grep'
brew 'coreutils' # Those that come with macOS are outdated
brew "pkg-config"
brew "ack"
brew "wget"
brew "httpie"
brew "ncdu"
brew "hub"
brew "tldr"
brew "bind" # used to have dig as binary
brew "nmap"
brew "fzf"
brew "bat"
brew "fx"
brew "exa"
brew "fswatch"
brew "ghostscript"
brew "zsh-autosuggestions"
brew "prettyping"
brew "ettercap"
brew "ffmpeg"
brew "gpg"
brew "ocrmypdf"
brew 'svn' # Needed to install fonts
brew 'mas' # Mac App Store manager
brew 'libpq' # PostgresQL client
brew 'jq' # JSON parser

# Development
# brew "dnsmasq"

# Fonts
cask "font-fira-code"
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-menlo-for-powerline'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

 # Apps
cask "keepingyouawake"
cask 'discord'
cask 'docker'
cask 'insomnia'
# cask 'slack'
# cask 'visual-studio-code'
# cask 'zoom'
cask 'helo'
cask 'telegram-desktop'

# Quicklook
cask "syntax-highlight"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "qlprettypatch"
cask "quicklook-csv"
cask "suspicious-package"
cask "webpquicklook"
cask "qlimagesize"

# mas 'Byword', id: 420212497
# mas 'Giphy Capture', id: 668208984
# mas 'Keynote', id: 409183694
# mas 'Numbers', id: 409203825
# mas 'Spark', id: 1176895641
# mas 'Speedtest', id: 1153157709
# mas 'Things', id: 904280696
# mas 'Tweetbot', id: 1384080005
